day1 = '1'
day2 = '2'
day3 = '3'
day4 = '4'
day5 = '5'
day6 = '6'
day7 = '7'
day8 = '8'
day9 = '9'
day10 = '10'
day11 = '11'
day12 = '12'
day13 = '13'
day14 = '14'
day15 = '15'
day16 = '16'
day17 = '17'
day18 = '18'
day19 = '19'
day20 = '20'
day21 = '21'
day22 = '22'
day23 = '23'
day24 = '24'
day25 = '25'
day26 = '26'
day27 = '27'
day28 = '28'
day29 = '29'
day30 = '30'
day31 = '31'

JANUARY = '1'
FEBRUARY = '2'
MARCH = '3'
APRIL = '4'
MAY = '5'
JUNE = '6'
JULY = '7'
AUGUST = '8'
SEPTEMBER = '9'
OCTOBER = '10'
NOVEMBER = '11'
DECEMBER = '12'

a = []
for i in range(2021, 2092):
    a.append(i)


b = []
for f in range(1, 71):
    b.append(f)


b =  str(a)   # Преобразовывает все числовые значения в строки


DAY_CHOICES = (
    (day1, '1'),
    (day2, '2'),
    (day3, '3'),
    (day4, '4'),
    (day5, '5'),
    (day6, '6'),
    (day7, '7'),
    (day8, '8'),
    (day9, '9'),
    (day10, '10'),
    (day11, '11'),
    (day12, '12'),
    (day13, '13'),
    (day14, '14'),
    (day15, '15'),
    (day16, '16'),
    (day17, '17'),
    (day18, '18'),
    (day19, '19'),
    (day20, '20'),
    (day21, '21'),
    (day22, '22'),
    (day23, '23'),
    (day24, '24'),
    (day25, '25'),
    (day26, '26'),
    (day27, '27'),
    (day28, '28'),
    (day29, '29'),
    (day30, '30'),
    (day31, '31'),

)

MONTH_CHOICES = (
    (JANUARY, 'Январь'),
    (FEBRUARY, 'Февраль'),
    (MARCH, 'Март'),
    (APRIL, 'Апрель'),
    (MAY, 'Май'),
    (JUNE, 'Июнь'),
    (JULY, 'Июль'),
    (AUGUST, 'Август'),
    (SEPTEMBER, 'Сентябрь'),
    (OCTOBER, 'Октябрь'),
    (NOVEMBER, 'Ноябрь'),
    (DECEMBER, 'Декабрь'),
)




YEAR_CHOICES = (
    (b[0], a[0]),
    (b[1], a[1]),
    (b[2], a[2]),
    (b[3], a[3]),
    (b[4], a[4]),
    (b[5], a[5]),
    (b[6], a[6]),
    (b[7], a[7]),
    (b[8], a[8]),
    (b[9], a[9]),
    (b[10], a[10]),
    (b[11], a[11]),
    (b[12], a[12]),
    (b[13], a[13]),
    (b[14], a[14]),
    (b[15], a[15]),
    (b[16], a[16]),
    (b[17], a[17]),
    (b[18], a[18]),
    (b[19], a[19]),
    (b[20], a[20]),
    (b[21], a[21]),
    (b[22], a[22]),
    (b[23], a[23]),
    (b[24], a[24]),
    (b[25], a[25]),
    (b[26], a[26]),
    (b[27], a[27]),
    (b[28], a[28]),
    (b[29], a[29]),
    (b[30], a[30]),
    (b[31], a[31]),
    (b[32], a[32]),
    (b[33], a[33]),
    (b[34], a[34]),
    (b[35], a[35]),
    (b[36], a[36]),
    (b[37], a[37]),
    (b[38], a[38]),
    (b[39], a[39]),
    (b[40], a[40]),
    (b[41], a[41]),
    (b[42], a[42]),
    (b[43], a[43]),
    (b[44], a[44]),
    (b[45], a[45]),
    (b[46], a[46]),
    (b[47], a[47]),
    (b[48], a[48]),
    (b[49], a[49]),
    (b[50], a[50]),
    (b[51], a[51]),
    (b[52], a[52]),
    (b[53], a[53]),
    (b[54], a[54]),
    (b[55], a[55]),
    (b[56], a[56]),
    (b[57], a[57]),
    (b[58], a[58]),
    (b[59], a[59]),
    (b[60], a[60]),
    (b[61], a[61]),
    (b[62], a[62]),
    (b[63], a[63]),
    (b[64], a[64]),
    (b[65], a[65]),
    (b[66], a[66]),
    (b[67], a[67]),
    (b[68], a[68]),
    (b[69], a[69]),
    (b[-1], a[-1]),

)
